In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
titanic = sns.load_dataset("titanic")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [3]:
titanic[["age", "fare", "survived"]]

      age     fare  survived
0    22.0   7.2500         0
1    38.0  71.2833         1
2    26.0   7.9250         1
3    35.0  53.1000         1
4    35.0   8.0500         0
..    ...      ...       ...
886  27.0  13.0000         0
887  19.0  30.0000         1
888   NaN  23.4500         0
889  26.0  30.0000         1
890  32.0   7.7500         0

[891 rows x 3 columns]

In [4]:
titanic.nlargest(3, columns=["fare", "age"])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True

In [7]:
titanic.nsmallest(3, columns=["age"])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False
755,1,2,male,0.67,1,1,14.5000,S,Second,child,False,NaN,Southampton,yes,False
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False

In [8]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [10]:
nba = pd.read_csv("datas/nba.csv", parse_dates=["Birthday"])
nba

               Name                 Team Position   Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG 1996-09-26   1445697
1    Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
2     PJ Washington    Charlotte Hornets       PF 1998-08-23   3831840
3      Derrick Rose      Detroit Pistons       PG 1988-10-04   7317074
4     Marial Shayok   Philadelphia 76ers        G 1995-07-26     79568
..              ...                  ...      ...        ...       ...
445   Austin Rivers      Houston Rockets       PG 1992-08-01   2174310
446     Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
447     Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448   Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449     Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 5 columns]

In [12]:
nba.dtypes

Name                object
Team                object
Position            object
Birthday    datetime64[ns]
Salary               int64
dtype: object

In [29]:
nba.dtypes.value_counts()

object            3
datetime64[ns]    1
int64             1
dtype: int64

In [30]:
nba.ndim

2

In [31]:
nba.shape

(450, 5)

In [34]:
nba.columns

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [41]:
nba.index

RangeIndex(start=0, stop=450, step=1)

In [66]:
len(nba) - nba.count()

Name        0
Team        0
Position    0
Birthday    0
Salary      0
dtype: int64

In [87]:
nba.count().sum()

2250

In [89]:
nba.nunique()

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [91]:
nba.max()

Name             Zylan Cheatham
Team         Washington Wizards
Position                     SG
Birthday    2000-12-23 00:00:00
Salary                 40231758
dtype: object

In [92]:
nba.min()

Name               Aaron Gordon
Team              Atlanta Hawks
Position                      C
Birthday    1977-01-26 00:00:00
Salary                    79568
dtype: object

In [76]:
class NBATeam:
    def __init__(self, name, team):
        self.name = ''
        self.team = ''
        self.birthday = ''  
        self.salary = 0
        
    def infomation(self):
        print(f'{self.name}의 팀은 {self.team} 입니다.')

In [77]:
nba_team = NBATeam('Michael', 'Chicago')

In [78]:
nba_team.name = 'A'

In [94]:
nba.loc[nba["Name"] == "Zylan Cheatham"]

               Name                  Team Position   Birthday  Salary
248  Zylan Cheatham  New Orleans Pelicans       SF 1995-11-17   79568

In [95]:
nba.iloc[248]

Name              Zylan Cheatham
Team        New Orleans Pelicans
Position                      SF
Birthday     1995-11-17 00:00:00
Salary                     79568
Name: 248, dtype: object

In [99]:
nba.nlargest(5, columns=["Salary"])

                  Name                   Team Position   Birthday    Salary
205      Stephen Curry  Golden State Warriors       PG 1988-03-14  40231758
38          Chris Paul  Oklahoma City Thunder       PG 1985-05-06  38506482
219  Russell Westbrook        Houston Rockets       PG 1988-11-12  38506482
251          John Wall     Washington Wizards       PG 1990-09-06  38199000
264       James Harden        Houston Rockets       PG 1989-08-26  38199000

In [98]:
nba.nsmallest(5, columns=["Salary"])

               Name                    Team Position   Birthday  Salary
4     Marial Shayok      Philadelphia 76ers        G 1995-07-26   79568
12     Norvel Pelle      Philadelphia 76ers       FC 1993-02-03   79568
24     Jaylen Hoard  Portland Trail Blazers       SF 1999-03-30   79568
25       Tyler Cook     Cleveland Cavaliers       PF 1997-09-23   79568
31  Michael Frazier         Houston Rockets        G 1994-03-08   79568

In [101]:
nba.nsmallest(5, columns=["Birthday"])

               Name               Team Position   Birthday    Salary
98     Vince Carter      Atlanta Hawks       PF 1977-01-26   2564753
196   Udonis Haslem         Miami Heat        C 1980-06-09   2564753
262     Kyle Korver    Milwaukee Bucks       PF 1981-03-17   6004753
149  Tyson Chandler    Houston Rockets        C 1982-10-02   2564753
415  Andre Iguodala  Memphis Grizzlies       SF 1984-01-28  17185185

In [106]:
nba.sum(numeric_only=True)

Salary    3444112694
dtype: int64

In [107]:
nba.mean(numeric_only=True)

Salary    7.653584e+06
dtype: float64

In [108]:
nba.median(numeric_only=True)

Salary    3303074.5
dtype: float64

In [109]:
nba.std(numeric_only=True)

Salary    9.288810e+06
dtype: float64

In [110]:
titanic.sort_values(by=["fare","age","sex"], ascending=[False, True, True], na_position="last")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
481,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
633,0,1,male,NaN,0,0,0.0000,S,First,man,True,NaN,Southampton,no,True
674,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
732,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
815,0,1,male,NaN,0,0,0.0000,S,First,man,True,B,Southampton,no,True

In [160]:
titanic['sex'].value_counts().sort_values(ascending=False)

male      577
female    314
Name: sex, dtype: int64

In [165]:
data = {
    "A" : [10, 14, 18],
    "B" : [11, 15, 19],
    "C" : [12, 16, 20],
    "D" :[13, 17, 21]
}
index = ["a", "b", "c"]
columns = ["A", "B", "C", "D"]
df = pd.DataFrame(data, index = index, columns=columns)
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [173]:
df = pd.DataFrame(np.arange(10, 22).reshape(3,4),
                  index=['a', 'b', 'c'],
                  columns=['A', 'B', 'C', 'D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [174]:
df.loc["a"] # row를 기준으로 함

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [175]:
df.loc["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [176]:
df["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [180]:
df.loc["b": ,"A"]

b    14
c    18
Name: A, dtype: int32

In [181]:
df.loc["a",:]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [182]:
df.loc[["a","b"],["B","D"]]

    B   D
a  11  13
b  15  17

In [183]:
df.loc[df.A>10, ["C","D"]]

    C   D
b  16  17
c  20  21

In [184]:
df.iloc[0, 1]

11

In [186]:
df.iloc[:2, 2]

a    12
b    16
Name: C, dtype: int32

In [187]:
df.iloc[0, -2:]

C    12
D    13
Name: a, dtype: int32

In [188]:
df.iloc[2:3, 1:3]

    B   C
c  19  20

In [189]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [190]:
df.iloc[-1]

A    18
B    19
C    20
D    21
Name: c, dtype: int32

In [199]:
titanic["age"].mean()

29.69911764705882

In [260]:
titanic.loc[titanic["sex"] == "female"]["age"].mean()

27.915708812260537

In [279]:
titanic.loc[titanic["pclass"] == 1][titanic["sex"] == "female"]["age"].mean()

C:\Users\user\AppData\Local\Temp\ipykernel_12344\1615897855.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  titanic.loc[titanic["pclass"] == 1][titanic["sex"] == "female"]["age"].mean()

34.61176470588235

In [280]:
round(titanic['age'].mean(), 1)

29.7

In [281]:
round(titanic[titanic['sex'] == 'female']['age'].mean(), 1)

27.9

In [285]:
round(titanic[(titanic['pclass'] == 1) & (titanic['sex'] == 'female')]['age'].mean(), 1)

34.6

In [290]:
classmates = pd.read_csv("datas/teams.csv")
classmates

     성명 성별
0   강예림  여
1   강호정  남
2   고유리  여
3   김정인  여
4   김지성  남
5   김지오  여
6   노재승  남
7   박기영  남
8   박수현  여
9   배선화  여
10  서덕원  남
11  유승현  남
12  유영은  여
13  유예빈  여
14  유준선  남
15  윤영주  여
16  이유단  여
17  이윤진  여
18  이주현  여
19  이주현  남
20  임혜신  여
21  장서현  여
22  정현호  남
23  조세연  남
24  조재희  남
25  채경민  남
26  최진명  남
27  한혜원  여